app/views/sessions/show.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
					  <% if x %>
						  <% cat = Category.find(x.category_id).name %>