app/views/steps/_quiz.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 4]]
---
     <div class="quiz" id='quiz_<%= v.id %>'>
        <% v.questions.each do |q| %>