app/controllers/assignments_controller.rb

SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_assignment
      @assignment = Assignment.find(params[:id])