app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"

  def create
    @assignment = Assignment.new({name: assignment_params[:name], step_id: assignment_params[:step_id], desc: assignment_params[:desc]})
    @assignment.save
    @stepx = Step.find(assignment_params[:step_id])
    @assignmentx = Assignment.where(name:assignment_params[:name])
    @cat = Category.find(@stepx.category_id)
    @assignmentx.each do |x|
      @assignmentx = x
    end
    @substep = Substep.new({
      typex: assignment_params[:typex],
      sid: @assignmentx.id,
      Step_id: @stepx.id
      })


    respond_to do |format|
      if @substep.save
---
INSERT INTO "assignments" ("name", "desc", "step_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Testassignment"], ["desc", "testar göra ett assignment"], ["step_id", 1], ["created_at", "2015-02-05 10:20:46.248244"], ["updated_at", "2015-02-05 10:20:46.248244"]]
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT 1  [["id", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."name" = ?  [["name", "dksldksldksl"]]
INSERT INTO "substeps" ("typex", "sid", "Step_id", "row_order", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["typex", "assignment"], ["sid", 1], ["Step_id", 1], ["row_order", 6291456], ["created_at", "2015-02-19 14:22:07.228378"], ["updated_at", "2015-02-19 14:22:07.228378"]]