app/controllers/categories_controller.rb

SELECT "activities".* FROM "activities"  ORDER BY created_at desc
SELECT "categories".* FROM "categories"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @activities = PublicActivity::Activity.order("created_at desc")
    if current_user
      @categories = Category.all
      @user = User.find(current_user.id)

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ?  [["name", "test-kategori-helt-galen-"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @category = Category.where(name: Category.normalize_cat(params[:category_name]))
    if current_user
      @completion = User.find(current_user.id).completion

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "categories" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Historia"], ["desc", "Gustaf vasa"], ["created_at", "2015-02-03 10:38:52.266515"], ["updated_at", "2015-02-03 10:38:52.266515"]]
INSERT INTO "activities" ("parameters", "owner_id", "owner_type", "key", "trackable_id", "trackable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @owner = User.find(current_user.id)
    @category = Category.new({name:Category.normalize_cat(category_params[:name]), desc:category_params[:desc]})
    respond_to do |format|
      if @category.save
        @category.create_activity :create, owner: @owner, key: "har skapat en modul: #{view_context.link_to(@category.name, category_path(@category.name))}".html_safe