app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = Comment.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("msg", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["msg", "dsa"], ["category_id", 1], ["user_id", 1], ["created_at", "2015-03-03 12:29:00.905333"], ["updated_at", "2015-03-03 12:29:00.905333"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "activities" ("parameters", "owner_id", "owner_type", "key", "trackable_id", "trackable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @owner = User.find(current_user.id)
    @comment = Comment.new(comment_params)
    @category = @comment.category.name



    respond_to do |format|
      if @comment.save
        @category_id = @comment.category_id
        @categoryx = Category.find(@comment.category_id)
        @comments = @categoryx.comments.order('created_at desc')

        @commentsxx = Hash[@comments.reverse]
        @comment.create_activity :create, owner: @owner, key: "har kommenterat på en modul: #{view_context.link_to(@category, category_path(@category))}".html_safe

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_comment
      @comment = Comment.find(params[:id])