app/controllers/examinations_controller.rb

SELECT "examinations".* FROM "examinations"
---
  def index
    @examinations = Examination.all

INSERT INTO "examinations" ("name", "desc", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hej"], ["desc", "hejsan"], ["category_id", 1], ["created_at", "2015-02-04 08:41:26.403593"], ["updated_at", "2015-02-04 08:41:26.403593"]]
---
  def create
    @examination = Examination.new(examination_params)
    @category = @examination.category.name

    respond_to do |format|
      if @examination.save

UPDATE "examinations" SET "category_id" = ?, "updated_at" = ? WHERE "examinations"."id" = ?  [["category_id", 0], ["updated_at", "2015-02-03 10:33:39.147908"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @examination.update(examination_params)

SELECT  "examinations".* FROM "examinations" WHERE "examinations"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_examination
      @examination = Examination.find(params[:id])