app/controllers/guides_controller.rb

SELECT "guides".* FROM "guides"
---
  def index
    @guides = Guide.all

INSERT INTO "guides" ("name", "step_id", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "jfkdjfkdj"], ["step_id", 1], ["desc", "<p>jkfjkdjfkdj</p>\r\n"], ["created_at", "2015-02-19 14:22:57.215501"], ["updated_at", "2015-02-19 14:22:57.215501"]]
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT 1  [["id", 1]]
SELECT "guides".* FROM "guides" WHERE "guides"."name" = ?  [["name", "jfkdjfkdj"]]
INSERT INTO "substeps" ("typex", "sid", "Step_id", "row_order", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["typex", "guide"], ["sid", 1], ["Step_id", 1], ["row_order", 7340032], ["created_at", "2015-02-19 14:22:57.296894"], ["updated_at", "2015-02-19 14:22:57.296894"]]
---
  def create
    @guide = Guide.new({name: guide_params[:name], step_id: guide_params[:step_id], desc: guide_params[:desc]})
    @guide.save
    @stepx = Step.find(guide_params[:step_id])
    @guidex = Guide.where(name:guide_params[:name])
    @cat = Category.find(@stepx.category_id)


    @guidex.each do |x|
      @guidex = x
    end
    @substepx = Substep.new({
      typex: guide_params[:typex],
      sid: @guidex.id,
      Step_id: @stepx.id
      })

    respond_to do |format|
      if @substepx.save

UPDATE "guides" SET "desc" = ?, "updated_at" = ? WHERE "guides"."id" = ?
---
  def update
    respond_to do |format|
      if @guide.update(guide_params)

SELECT  "guides".* FROM "guides" WHERE "guides"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_guide
      @guide = Guide.find(params[:id])