app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @questions = Question.all

SELECT "questions".* FROM "questions"
---
  def new
    @questions = Question.all

INSERT INTO "questions" ("question", "option1", "option2", "answer", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["question", "vad är 1+1"], ["option1", "1"], ["option2", "3"], ["answer", "2"], ["quiz_id", 1], ["created_at", "2015-02-03 13:38:22.765644"], ["updated_at", "2015-02-03 13:38:22.765644"]]
---
  def create
    @question = Question.new(question_params)
    @quiz = @question.quiz_id

    respond_to do |format|
      if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_question
      @question = Question.find(params[:id])