app/controllers/quizzes_controller.rb

SELECT  "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "substeps" ("typex", "sid", "Step_id", "row_order", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["typex", "quiz"], ["sid", 1], ["Step_id", 1], ["row_order", 4194304], ["created_at", "2015-02-19 14:21:56.306778"], ["updated_at", "2015-02-19 14:21:56.306778"]]
---
  def create
    @quiz = Quiz.new({name: quiz_params[:name], step_id: quiz_params[:step_id]})
    @quiz.save

    #Find step and category
    @stepx = Step.find(quiz_params[:step_id])
    @cat = Category.find(@stepx.category_id)
    #Find quiz
    @quizx = Quiz.where(name:quiz_params[:name])
    @quizx.each do |x|
      @quizx = x
    end
    #new substep
    @substepx = Substep.new({
      typex: quiz_params[:typex],
      sid: @quizx.id,
      Step_id: @stepx.id
      })

    respond_to do |format|
      if @substepx.save