app/controllers/sessions_controller.rb

  def index
    @sessions = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE (name LIKE '%Mikael%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (name LIKE '%mikael%')

  def show
    @usersearch = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def update
    respond_to do |format|
      @user = User.find(params[:id])
      if @user.update(session_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "f"], ["updated_at", "2015-02-19 19:36:32.525513"], ["id", 1]]

  def admin
    @user = User.new

    if current_user
      if current_user.admin?
        #do stuff
        @sessions = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"