app/controllers/steps_controller.rb

  def index
    @steps = Step.all
---
SELECT "steps".* FROM "steps"

  def update_row_order
    @substepx = Substep.find(substep_params[:substep_id])
    if @substepx.update({row_order_position:substep_params[:row_order_position]})
---
SELECT  "substeps".* FROM "substeps" WHERE "substeps"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "substeps" SET row_order = row_order + 1 WHERE "substeps"."id" IN (SELECT "substeps"."id" FROM "substeps" WHERE ("substeps"."id" != 1) AND ("substeps"."id" != 1) AND ("substeps"."row_order" >= -8386533)  ORDER BY "substeps"."row_order" ASC)

  def show
    puts "ASDASDASDASD"
    gon.stepname = Category.normalize_cat(params[:step_name])
    gon.catname = Category.normalize_cat(params[:category_name])
    gon.completion = current_user.completion if current_user

    unless current_user.completion[gon.catname]
      user = User.find(current_user.id)
      comp = JSON.parse(user.completion)
      comp[gon.catname] = {}
      comp[gon.catname][gon.stepname] = {}
      user.update({completion: comp.to_json})
    end

    @catname = params[:category_name]
    @step_items = []
    @step = Step.where(name:Category.normalize_cat(params[:step_name]))
        @step.each do |x|
          @step = x
        end
    @substep = Substep.rank(:row_order).where(step_id: @step.id)
    puts "HHHHHHHHEEELLOOOO"
    puts "SUBSTEP: " + @substep.to_s
    @substep.each do |x|
      if x.typex == "video"
        video = Video.find(x.sid)
        videox = video.attributes
        videox['uid'] = x.id
        @step_items.push(videox)
      elsif x.typex == "guide"
        guide = Guide.find(x.sid)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "steps".* FROM "steps" WHERE "steps"."name" = ?  [["name", "teststeg"]]
SELECT "substeps".* FROM "substeps" WHERE "substeps"."step_id" = 1  ORDER BY "substeps"."row_order" ASC
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT 1  [["id", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."step_id" = ?  [["step_id", 1]]
SELECT "guides".* FROM "guides" WHERE "guides"."step_id" = ?  [["step_id", 1]]

        guidex['uid'] = x.id
        @step_items.push(guidex)
      elsif x.typex == "assignment"
        assignment = Assignment.find(x.sid)
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."step_id" = ?  [["step_id", 1]]

      end
      @assignment = @assignments.new
      @quizzes = @steps.quizzes
      @quizzes.each do |q|
---
SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."step_id" = ?  [["step_id", 1]]

  def create
    @step = Step.new({name:Category.normalize_cat(step_params[:name]), desc:step_params[:desc], category_id:step_params[:category_id]})
    cat = Category.find(step_params[:category_id])
    #category = @step.category.name


    respond_to do |format|
      if @step.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "steps" ("name", "desc", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Teststep"], ["desc", "testar att göra steg"], ["category_id", 1], ["created_at", "2015-02-03 14:04:07.430204"], ["updated_at", "2015-02-03 14:04:07.430204"]]

    def set_step
      @step = Step.where(name:Category.normalize_cat(params[:step_name]))
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ?  [["name", "steps"]]
SELECT "steps".* FROM "steps" WHERE "steps"."name" = ? AND "steps"."category_id" = ?  [["name", "detta-ar-galet"], ["category_id", 1]]