app/controllers/videos_controller.rb

  def create
    @video = Video.new({name: video_params[:name], step_id: video_params[:step_id], url: video_params[:url]})
    @video.save
    # cat = Category.find(step_params[:category_id])
    step = Step.find(video_params[:step_id])
    cat = Category.find(step.category_id)
    @videox = Video.where(name:video_params[:name])
    @videox.each do |x|
      @videox = x
    end
    @substep = Substep.new({
      typex: video_params[:typex],
      sid: @videox.id,
      Step_id: step.id
      })

    respond_to do |format|
      if @substep.save
---
SELECT "videos".* FROM "videos" WHERE "videos"."name" = ?  [["name", "kglfkgfl"]]
INSERT INTO "substeps" ("typex", "sid", "Step_id", "row_order", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["typex", "video"], ["sid", 1], ["Step_id", 1], ["row_order", 0], ["created_at", "2015-02-19 14:21:39.496012"], ["updated_at", "2015-02-19 14:21:39.496012"]]