app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.all

SELECT  "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "videos" ("name", "url", "step_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "testvideo"], ["url", "https://www.youtube.com/watch?v=wZZWWmDQZmU"], ["step_id", 1], ["created_at", "2015-02-03 14:09:43.654393"], ["updated_at", "2015-02-03 14:09:43.654393"]]
---
  def create
    @video = Video.new(video_params)
    # cat = Category.find(step_params[:category_id])
    step = Step.find(video_params[:step_id])
    cat = Category.find(step.category_id)
    respond_to do |format|
      if @video.save

DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]
---
  def destroy
    @video.destroy

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_video
      @video = Video.find(params[:id])